eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/service/sleeptimer/src/sl_sleeptimer.c
/*******************************************************************************
 * Converts ticks in milliseconds.
 ******************************************************************************/
uint32_t sl_sleeptimer_tick_to_ms(uint32_t tick)
{
  if (is_power_of_2(timer_frequency)) {
    return (uint32_t)(((uint64_t)tick * (uint64_t)1000u) >> div_to_log2(timer_frequency));
  } else {
    return (uint32_t)(((uint64_t)tick * (uint64_t)1000u) / timer_frequency);
  }
}

/*******************************************************************************
 * Converts 64-bits ticks in milliseconds.
 ******************************************************************************/
sl_status_t sl_sleeptimer_tick64_to_ms(uint64_t tick,
                                       uint64_t *ms)
{
  if (tick <= UINT64_MAX / 1000) {
    if (is_power_of_2(timer_frequency)) {
      *ms =  (uint64_t)(((uint64_t)tick * (uint64_t)1000u) >> div_to_log2(timer_frequency));
      return SL_STATUS_OK;
    } else {
      *ms = (uint64_t)(((uint64_t)tick * (uint64_t)1000u) / timer_frequency);
      return SL_STATUS_OK;
    }
  } else {
    return SL_STATUS_INVALID_PARAMETER;
  }
}
/*******************************************************************************
 * Process timer interrupt.
 *
 * @param local_flag Flag indicating the type of timer interrupt.
 ******************************************************************************/
void process_timer_irq(uint8_t local_flag)
{
  CORE_DECLARE_IRQ_STATE;
  if (local_flag & SLEEPTIMER_EVENT_OF) {
#if SL_SLEEPTIMER_WALLCLOCK_CONFIG
    uint32_t timer_freq = sl_sleeptimer_get_timer_frequency();

    overflow_tick_rest += calculated_tick_rest;
    if (overflow_tick_rest >= timer_freq) {
      second_count++;
      overflow_tick_rest -= timer_freq;
    }
    second_count = second_count + calculated_sec_count;
#endif
    overflow_counter++;

    update_first_timer_delta();

    if (timer_head) {
      set_comparator_for_next_timer();
    }
  }

  if (local_flag & SLEEPTIMER_EVENT_COMP) {
    sl_sleeptimer_tick_count_t delta_tot = 0u;
    sl_sleeptimer_tick_count_t current_cnt = sleeptimer_hal_get_counter();
    sl_sleeptimer_timer_handle_t *current = NULL;
    uint32_t nb_timer_expire = 0u;

    delta_tot = current_cnt - last_delta_update_count;

    CORE_ENTER_ATOMIC();
    // Process all timers that have expired.
    while ((timer_head) && (delta_tot >= timer_head->delta)) {
      sl_sleeptimer_tick_count_t new_cnt;
      sl_sleeptimer_tick_count_t delta_tot_temp = delta_tot;
      sl_sleeptimer_timer_handle_t *temp = timer_head;
      current = timer_head;

      last_delta_update_count = current_cnt;

      while ((temp != NULL) && (delta_tot_temp >= temp->delta)) {
        if (current->priority > temp->priority) {
          current = temp;
        }

        delta_tot_temp -= temp->delta;
        temp = temp->next;
      }
      CORE_EXIT_ATOMIC();
      delta_tot -= current->delta;
      current->delta = 0;

      CORE_ENTER_ATOMIC();
      delta_list_remove_timer(current);
      CORE_EXIT_ATOMIC();

      if (current->timeout_periodic != 0u) {
        CORE_ENTER_ATOMIC();
        delta_list_insert_timer(current, current->timeout_periodic);
        CORE_EXIT_ATOMIC();
      }

      if (current->callback != NULL) {
        current->callback(current, current->callback_data);
      }

      nb_timer_expire++;

      new_cnt = sleeptimer_hal_get_counter();
      delta_tot += new_cnt - current_cnt;
      current_cnt = new_cnt;
      CORE_ENTER_ATOMIC();
    }

    if ((nb_timer_expire == 1u)
        && (current->option_flags == SLI_SLEEPTIMER_POWER_MANAGER_EARLY_WAKEUP_TIMER_FLAG)) {
      sleep_on_isr_exit = true;
    } else {
      sleep_on_isr_exit = false;
    }

    if (timer_head) {
      timer_head->delta -= delta_tot;
      last_delta_update_count = current_cnt;

      set_comparator_for_next_timer();
    } else {
      sleeptimer_hal_disable_int(SLEEPTIMER_EVENT_COMP);
    }
    CORE_EXIT_ATOMIC();
  }
}

/*******************************************************************************
 * Timer expiration callback for the delay function.
 *
 * @param handle Pointer to handle to timer.
 * @param data Pointer to delay flag.
 ******************************************************************************/
static void delay_callback(sl_sleeptimer_timer_handle_t *handle,
                           void *data)
{
  volatile bool *wait_flag = (bool *)data;

  (void)handle;  // Unused parameter.

  *wait_flag = false;
}

/*******************************************************************************
 * Inserts a timer in the delta list.
 *
 * @param handle Pointer to handle to timer.
 * @param timeout Timer timeout, in ticks.
 ******************************************************************************/
static void delta_list_insert_timer(sl_sleeptimer_timer_handle_t *handle,
                                    sl_sleeptimer_tick_count_t timeout)
{
  sl_sleeptimer_tick_count_t local_handle_delta = timeout;

  handle->delta = local_handle_delta;

  if (timer_head != NULL) {
    sl_sleeptimer_timer_handle_t *prev = NULL;
    sl_sleeptimer_timer_handle_t *current = timer_head;
    // Find timer position taking into accounts the deltas and priority.
    while (current != NULL
           && (local_handle_delta >= current->delta || current->delta == 0u
               || (((local_handle_delta - current->delta) == 0) && (handle->priority > current->priority)))) {
      local_handle_delta -= current->delta;
      handle->delta = local_handle_delta;
      prev = current;
      current = current->next;
    }

    // Insert timer in middle of delta list.
    if (prev != NULL) {
      prev->next = handle;
    } else {
      timer_head = handle;
    }
    handle->next = current;

    if (current != NULL) {
      current->delta -= local_handle_delta;
    }
  } else {
    timer_head = handle;
    handle->next = NULL;
  }
}

/*******************************************************************************
 * Removes a timer from delta list.
 *
 * @param handle Pointer to handle to timer.
 *
 * @return 0 if successful. Error code otherwise.
 ******************************************************************************/
static sl_status_t delta_list_remove_timer(sl_sleeptimer_timer_handle_t *handle)
{
  sl_sleeptimer_timer_handle_t *prev = NULL;
  sl_sleeptimer_timer_handle_t *current = timer_head;

